tap "gjbae1212/gossm"
tap "homebrew/autoupdate"
tap "iann0036/iamlive"

brew "ack"
brew "age"
brew "argocd"
brew "awscli"
brew "bat"
brew "btop"
brew "coreutils"
brew "crane"
brew "curl"
brew "diff-so-fancy"
brew "dive"
brew "docker-credential-helper-ecr"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-xargs"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "k9s"
brew "kind"
brew "kubecolor"
brew "kubeconform"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "macchina"
brew "mas"
brew "mise"
brew "neovim"
brew "nmap"
brew "pnpm"
brew "pre-commit"
brew "qemu"
brew "ripgrep"
brew "shellcheck"
brew "skopeo"
brew "sops"
brew "starship"
brew "staticcheck"
brew "stern"
brew "stow"
brew "terraform-docs"
brew "terragrunt"
brew "tflint"
brew "tmux"
brew "tree"
brew "trivy"
brew "uv"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gjbae1212/gossm/gossm"
brew "iann0036/iamlive/iamlive"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "chatgpt"
cask "claude"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono"
cask "ghostty"
cask "gitify"
cask "google-chrome"
cask "insomnia"
cask "obsidian"
cask "orbstack"
cask "orion"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "tailscale-app"
cask "utm"
cask "visual-studio-code"
cask "vlc"

mas "Amphetamine", id: 937984704
mas "Meeter", id: 1510445899

vscode "aswinkumar863.smarty-template-support"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mads-hartmann.bash-ide-vscode"
vscode "redhat.vscode-xml"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "yzhang.markdown-all-in-one"
