tap "danielfoehrkn/switch"
tap "gjbae1212/gossm"
tap "homebrew/autoupdate"
tap "iann0036/iamlive"
tap "minamijoyo/tfedit"

brew "ack"
brew "act"
brew "age"
brew "argocd"
brew "atuin"
brew "awscli"
brew "bat"
brew "btop"
brew "coreutils"
brew "crane"
brew "curl"
brew "diff-so-fancy"
brew "dive"
brew "docker-credential-helper-ecr"
brew "doggo"
brew "dyff"
brew "fd"
brew "fetch"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-xargs"
brew "glow"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "k9s"
brew "kind"
brew "kubectl"
brew "kubecolor"
brew "kustomize"
brew "lsd"
brew "mage"
brew "mas"
brew "neovim"
brew "nmap"
brew "pre-commit"
brew "python@3.10"
brew "shellcheck"
brew "skopeo"
brew "sops"
brew "starship"
brew "staticcheck"
brew "step"
brew "stern"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv"
brew "tflint"
brew "tmux"
brew "tree"
brew "trivy"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "danielfoehrkn/switch/switch"
brew "gjbae1212/gossm/gossm"
brew "iann0036/iamlive/iamlive"
brew "minamijoyo/tfedit/tfedit"

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono"
cask "ghostty"
cask "gitify"
cask "google-chrome"
cask "insomnia"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "tailscale"
cask "visual-studio-code"
cask "vlc"

mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899

vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "technosophos.vscode-helm"
vscode "timonwong.shellcheck"
vscode "yzhang.markdown-all-in-one"
