cask_args appdir: "/Applications", require_sha: true

tap "common-fate/granted"
tap "gjbae1212/gossm"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "ack"
brew "act"
brew "age"
brew "argocd"
brew "awscli"
brew "coreutils"
brew "crane"
brew "curl"
brew "diff-so-fancy"
brew "dive"
brew "exa"
brew "fd"
brew "fnm"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "go"
brew "gossm"
brew "granted"
brew "hadolint"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "kcat"
brew "kind"
brew "kubectx"
brew "kubernetes-cli"
brew "kyverno"
brew "mas"
brew "mongosh"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openssl"
brew "pre-commit"
brew "python@3.10"
brew "semgrep"
brew "shellcheck"
brew "starship"
brew "staticcheck"
brew "terraform-docs"
brew "testkube"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "wget"
brew "yarn", args: ["ignore-dependencies"]
brew "ykman"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password-cli"
cask "appcleaner"
cask "discord"
cask "firefox"
cask "font-hack"
cask "font-meslo-for-powerline"
cask "gitify"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "keybase"
cask "logitech-options"
cask "mongodb-compass"
cask "notion"
cask "orbstack"
cask "postico"
cask "raycast"
cask "rectangle"
cask "signal"
cask "slack"
cask "tailscale"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# App Store Apps
mas "Amphetamine", id: 937984704
mas "Meeter", id: 1510445899

# VSCode Extenstions
vscode "aswinkumar863.smarty-template-support"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "mads-hartmann.bash-ide-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "technosophos.vscode-helm"
vscode "timonwong.shellcheck"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"